[["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":[]}],["gameactivity",{"version":5,"data":[]}],["workshop_trendy_items",{"version":2}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"西安曼云网络科技有限公司","strURL":null}],"rgPublishers":[{"strName":"西安曼云网络科技有限公司","strURL":null}],"rgFranchises":[{"strName":"VTuber","strURL":null},{"strName":"虚拟主播","strURL":null},{"strName":"Live2D","strURL":null},{"strName":"MMD","strURL":null},{"strName":"motion capture","strURL":null},{"strName":"facial capture","strURL":null},{"strName":"Animation","strURL":null},{"strName":"3D","strURL":null}]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1207050/extras/English.png?t=1687870739[/img]\r\nVUP is a VTuber tool, based on real-time capture technology, low-cost, zero-based to realize animation video production and multi-person cross-platform virtual livestream, opening a new era in which everyone is a VTuber.\r\n[h2]Welcome to join VUP Discord server[/h2]\r\nhttps://discord.gg/DVV6rXyxny\r\n\r\n[h2]Lower CPU usage, the new VUP-Live2D version is coming~[/h2]\r\nVUP not only supports 3D models, but also Live2D models\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1207050/extras/star_eyes_background.gif?t=1687870739[/img]\r\n\r\n[h2]What can VUP do?[/h2]\r\n[list]\r\n[*][b]Facial Capture[/b]\r\nOnly an ordinary camera is needed, and the avatar will synchronize your eyes, eyebrows, mouth expressions in real time\r\nYou can make the avatar doing these expressions, such as wink, blink your eyes at the same time, move eyeballs, open mouth, raise eyebrows, bulging face, etc.\r\n[*][b]Motion Capture[/b]\r\nVUP provides a variety of motion capture data ports, connect the motion capture device to your computer, then enable VUP motion capture, the avatar will synchronize your limbs and fingers movement in real time.\r\nSupported motion capture such as: Leap Motion (Third Generation), Kinect v2, Noitom PN, Xsens, Intel Realsense (some models), ChingMu optical motion tracking, etc.\r\n[*][b]Voice Capture[/b]\r\nSpeaking to the microphone, and the avatar will make the corresponding mouth shape in real time.\r\n[*][b]Customize models, emojis, animations, props, and scenes[/b]\r\nYou can customize models(vrm, model3.json, pmx, fbx), emojis, actions (fbx, vmd, bvh), props (fbx, pmx), and scenes (Unity3D scene, png, mp4)\r\nNote: pmx and fbx formats need to be converted to vup format by Unity 2018.4.x before they can be imported into VUP.\r\n[*][b]Shortcut Key[/b]\r\nYou can customize and trigger shortcut keys of expressions, actions, cameras, Pose, etc.\r\n[*][b]Prop[/b]\r\nYou can customize the props and the prop plans for your avatar.\r\n[*][b]Virtual Camera[/b]\r\nVUP has a built-in virtual camera, you can project your avatar to Zoom, Discord, Skype, Google Meet, Microsoft Teams, etc.\r\n[*][b]Animation[/b]\r\nVUP has a large number of built-in animations, which can be used to record short movies\r\nAnd you can also import your animation.\r\n[*][b]Transparent Streaming[/b]\r\nNo need to filter the background color by the &quot;chroma key&quot;，You can also get an avatar with transparent background\r\nTransparent Streaming is only applicable to OBS, Streamlabs and other live streaming tools that can set &quot;Allow Transparency&quot;.\r\n[*][b]Pose[/b]\r\nYou can choose a frame of the action in the action library as a pose, or you can customize a new pose.\r\n[*][b]Camera[/b]\r\nYou can customize the fixed shots, tracking shots , Pan shots, orbiting shots , linear motion shots , and transition effect of camera.\r\n[*][b]Auto wink &amp; Auto looking camera[/b]\r\n[*][b]Screenshot[/b]\r\nYou can customize the size of the screenshot, the location where the screenshot is stored, and get a screenshot with a transparent background.\r\n[*][b]Scene parameters can be set[/b]\r\nSuch as lighting, filters, depth of field, ambient light, sound, etc.\r\n[/list]\r\n\r\nMore features, looking forward to your discovery ^_^\r\n\r\n[h2]Contact us[/h2]\r\nIf you have any problems and suggestions, you can find us in the following ways.\r\n\r\nVUP Official Email: a@vlivemax.com\r\nVUP Discord server: https://discord.gg/DVV6rXyxny\r\nTwitter: https://twitter.com/vup_v\r\nYouTube: https://www.youtube.com/c/VTuberToolVUP","strSnippet":"VUP is a VTuber tool, based on real-time capture technology, low-cost, zero-based to realize animation video production and multi-person cross-platform virtual livestream, opening a new era in which everyone is a VTuber."}}]]