[["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":[]}],["gameactivity",{"version":5,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Analogue Reverie","strURL":null}],"rgPublishers":[{"strName":"Analogue Reverie","strURL":null}],"rgFranchises":[]}}],["descriptions",{"version":1,"data":{"strFullDescription":"The residents of the fantastic world of Gensokyo have woken up to find that the very fabric of existence has been distorted! Polished diamonds are growing on trees, dirt paths are now made of fancy glass, the distances between landmarks have changed, and even people seem to be behaving differently! To find out what's going on, the defenders of Gensokyo must explore a surreal new world and maybe even learn to bend the rules of reality themselves...\r\n\r\nTouhou Jitsuzaisou ~ Dream Logical World (東方実在相 ~ Dream Logical World, lit. &quot;Eastern Aspects of Existence&quot;) is a Touhou Project fan game. The shoot-'em-up gameplay, in which you'll shoot down enemies and bosses while dodging complex attacks, will be familiar to fans of the series. In this adventure, though, you'll be able to harness the fluctuating nature of existence with reality-breaking Aspect Shifts in place of traditional bombs. 12 playable characters, arranged in teams of two, all have their own Aspect Shift with a unique gameplay-altering effect. To rack up high scores and survive to the end of the game, you'll need to master your chosen characters' Aspect Shifts and keep them active for as long as you can.\r\n\r\nWith five difficulty modes, Dream Logical World can be enjoyed by anyone from shoot-'em-up novices to expert players. The game offers several practice options to help you craft your strategies. And for those interested in lore, every team's separate scenario weaves together into a story with many mysteries and twists along the way.","strSnippet":"A reality-bending, strategy-oriented Touhou Project fan game. Shoot down enemies, dodge bullets and use Aspect Shifts to warp existence."}}],["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}]]