[["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":["COoHELKGmMEGGYaVeQIAAHABIWvR7AQBABABKexcGwAAAAAAUakB0JjWZBoHYLKGmMEGcLKGmMEG"]}],["gameactivity",{"version":5,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"DIGIFOX","strURL":null}],"rgPublishers":[{"strName":"Games Operators","strURL":"https://store.steampowered.com/publisher/gameops"}],"rgFranchises":[{"strName":"Games Operators","strURL":"https://store.steampowered.com/franchise/gameops"}]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1793260/extras/Deliveries_en.gif?t=1747321598[/img]\r\n\r\nDelivery INC puts you in control of operating a delivery company. Your goal is to pick up passengers, packages and food, then deliver them before the customer’s patience runs out. Make quick decisions and test your logic as you manage multiple deliveries at once. Which driver will pick up the next delivery? Should they pick up or drop off other deliveries on the way? String together the best plan and route while making sure you don’t leave your customers waiting too long.\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1793260/extras/situations.gif?t=1747321598[/img]\r\n\r\nYour delivery drivers will occasionally find themselves facing difficult challenges causing them to reach out to you for helpful advice. Make your choices wisely to avoid disaster and turn the situation into something positive. Take chances, explore multiple outcomes, and expect the unexpected with random elements that keep things fresh.\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1793260/extras/Cities_en.gif?t=1747321598[/img]\r\n\r\nStart your company in any city, anywhere in the world. Test your skills on the most realistic roads and routes possible. Every city is created using real-world map data.\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1793260/extras/manage-fleet.gif?t=1747321598[/img]\r\n\r\nYour fleet of vehicles and drivers is a key part of running a successful company. Each driver has personality traits that can positively or negatively influence their performance. Every vehicle has advantages and disadvantages. Assemble a crew that best fits your company and playstyle.\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1793260/extras/Reviews_en.gif?t=1747321598[/img]\r\n\r\nCustomer reviews can have a drastic impact on your company's reputation, so it’s important to make sure each customer has the best possible experience. Having a high average rating will increase your number of customers and profits. A low average rating will leave you struggling to survive.","strSnippet":"Delivery INC is a fast-paced time management game where you’ll be challenged with quick decision making and planning. Build a fleet of vehicles and drivers. Make deliveries before the customer’s patience runs out. Put your logic and delivery skills to the test in any real-world city."}}]]