[["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":[]}],["gameactivity",{"version":5,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Element Games, LLC","strURL":"https://store.steampowered.com/developer/elementgames"}],"rgPublishers":[{"strName":"Element Games, LLC","strURL":"https://store.steampowered.com/publisher/elementgames"}],"rgFranchises":[]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2468370/extras/animatedlogo_470x157.gif?t=1734710912[/img]\r\n\r\nPlay a Demo version of Reality Break, a fast-paced and visceral looter shooter with many interlocking systems and an opt-in roguelite structure, all modifiable via a new Rewrite mechanic that allows you to alter the fundamental nature of the gameplay!\r\n\r\n[list]\r\n[*] Have you found the perfect Epic Nano-Mesh armor for your ship, with an amazing bonus effect, but you already have your favorite Epic Armor equipped? Rewrite the new drop into an Epic CPU so that you can [b]equip both[/b]!\r\n[*] Mission time limit too short? Rewrite the mission itself to give yourself 20 minutes... [i]or 20 hours![/i]\r\n[*] Certain items, such as Turbolasers mounted on Warships, are too large to fit on your starfighter. [i]But are they?[/i]\r\n[*] Why add 10 to your ship's Power, when you can [b]multiply[/b] it by 10 instead?\r\n[*] Is the cooldown on your favorite Active skill too long for your tastes? Unleash your Rewrite power to turn it into a [b]Passive[/b] skill that is always on!\r\n[/list]\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2468370/extras/teaser_trailer_gameplay_-_colossus,_spread_shot,_swarmer_2_Trim.mp4.gif?t=1734710912[/img]\r\n\r\n[h2]Opt-in Roguelite[/h2]\r\nWhen you choose to reset your timeline, many elements of the game will change, often in surprising or even subtle ways! Each time, you can Rewrite the structure of reality itself, applying those changes to all future Pilots you create via a metagame Talent system:\r\n\r\n\r\n[list]\r\n[*] Enable powerful secret [b]Fate Affixes[/b] that can begin appearing on all future loot drops!\r\n[*] Preserve a [b]Favored Item[/b] from one timeline to the next!\r\n[*] Activate the [b]Ship Loadouts[/b] feature to swap to a separate set of ship equipment instantly... then, Rewrite your secondary loadout so that its items continue to boost your combat power even while that loadout is deactivated!\r\n[*] Prevent low-quality items from dropping, and instantly Rewrite them to extract valuables in their place!\r\n[/list]\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2468370/extras/teaser_trailer_gameplay_-_dormant_warship,_twin_bolt,_envelop_Trim.mp4.gif?t=1734710912[/img]\r\n\r\n[h2]Interconnected systems[/h2]\r\nPlay through multiple timelines, upgrade your ship, and discover fantastical powers for your pilot character!\r\n\r\n\r\n[list]\r\n[*] Use the [b]Analysis[/b] system in real-time to unlock [b]Discoveries[/b] for your items! Come back to the game the next day or the next week to discover just how powerful your loot has gotten. If it's taking too long, Rewrite the Analysis system itself to speed it up!\r\n[*] Through the [b]Codex[/b], obtain powerful [b]Set Bonuses[/b] by looting specific groups of item types! Then, upgrade the Codex to scale its bonuses based on the rarity of the loot you find, and even Rewrite it so you can activate more than a single Set Bonus at a time!\r\n[*] Buy ship upgrades from the [b]Tech Specialist[/b], including slots for brand new types of equipment, such as deadly Drones that grant unique bonuses. Your ship can only fit so many upgrades, so choose wisely... or, grow powerful enough to Rewrite those limitations out of existence!\r\n[/list]\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2468370/extras/teaser_trailer_gameplay_-_maelstrom,_drones_2_Trim.mp4.gif?t=1734710912[/img]\r\n\r\nAltering the fabric of reality itself is no trivial power, and will not go unnoticed. You may get away with it for some time, but as your capabilities increase, so will the threats you awaken!\r\n\r\n\r\n[list]\r\n[*] Replaying the game unlocks shocking secrets and reveals new ways to look at the game's universe!\r\n[*] How did you obtain this power, and for what purpose? Who stands to benefit, and how will you come out in the end?\r\n[*] You are not alone. There are other forces swirling around you, as if in a chaotic maelstrom, and you must discover their true motivations before reality itself is left broken into pieces!\r\n[/list]\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/2468370/extras/teaser_trailer_gameplay_-_derelict,_scattergun,_nova,_ancients_2.mp4.gif?t=1734710912[/img]","strSnippet":"Rewrite the Universe! Pilot an agile starfighter, upgrade it with randomized loot, and unleash mystical fate energy to alter the fabric of spacetime itself!"}}],["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}]]