[["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"WinterSpring Games","strURL":"https://store.steampowered.com/curator/40841104"}],"rgPublishers":[{"strName":"WinterSpring Games","strURL":"https://store.steampowered.com/curator/40841104"}],"rgFranchises":[]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[p]Card Survival: Fantasy Forest is a card-based deep survival simulator and the next installment in the Card Survival Series.\r\n[/p][p]\r\n[/p][p]Experience what life would be like in the primordial forests of old. Carve out a home in a world teeming with beasts, spirits and monsters - where humans have yet to find their place.\r\n[/p][p]\r\n[/p][h2]Key Features:[/h2][p]\r\n[/p][p][b]Simple but deep System: [/b]\r\n[/p][p]A deep and detailed survival simulator in a visual card-based format that benefits from its mechanical simplicity and the power of your imagination.\r\n[/p][p]All interactions are done by using cards or combining them together.\r\n[/p][p]\r\n[/p][p][b]A Living Forest Ecosystem:[/b]\r\n[/p][p]Engage with a complex ecosystem featuring dynamically simulated forces (including animal and plant populations) that operate autonomously yet can be meaningfully influenced by your actions. Experience the cyclical nature of life through four distinct seasons and a full weather system.\r\n[/p][p]\r\n[/p][p][b]Realistic Character Simulation:[/b]\r\n[/p][p]Simulating the digestive and immune systems, detailed wounds and healing processes, and a mental health model that includes anxiety, mania, depression and altered mind states. Tracking everything from body weight, to calluses, stool consistency and more.\r\n[/p][p]\r\n[/p][p]\r\n[/p][h2]A large variety of content including:[/h2][p]\r\n[/p][p][b]Herbalism:[/b]\r\n[/p][p]Forage for different plants, learning where and when to find them, their uses and cultivation methods. Brew and prepare concoctions ranging from immune system boosters to stimulants, analgesics and spiritual enhancers.\r\n[/p][p]\r\n[/p][p][b]Agriculture:[/b]\r\n[/p][p]Cultivate a diverse range of crops, considering factors like season, soil nutrients, humidity and light and wind exposure. Utilize different preservation methods to preserve your harvests throughout the year. Grow animal feed, grains for bread and alcohol, seeds for oil, fibers for textiles and more. \r\n[/p][p]\r\n[/p][p][b]Hunting:[/b]\r\n[/p][p]Employ traps, spears, and bows to hunt a variety of animals, from small game to dangerous predators and even some of the unique beasts that roam the deeper parts of the forest.\r\n[/p][p]\r\n[/p][p][b]Animal Husbandry:[/b]\r\n[/p][p]Raise chicken, pigs, sheep and cows for products like milk, wool or eggs, or slaughter them for their meat and leather. Ensure their safety and comfort by building suitable facilities and attending to their health and well-being.\r\n[/p][p]\r\n[/p][p][b]Cooking:[/b]\r\n[/p][p]Create an array of dishes using ingredients like vegetables, fish, meat, cereal and dairy. The taste of your meals will depend on ingredient freshness and quality, spice choice, utensils and your own culinary skills.\r\n[/p][p]\r\n[/p][p][b]Crafting:[/b]\r\n[/p][p]Gain proficiency in woodworking, stone knapping, pottery, metalworking and tailoring to create a multitude of different tools and items. Craft your own tools, furniture, clothes, weapons, instruments and decorations.\r\n[/p][p]\r\n[/p][p][b]Building:[/b]\r\n[/p][p]Build yourself a forest dwelling, ranging from a rustic hut out of mud and reeds to a cozy wooden cottage. Add extra rooms, improve its insulation, fill it with comfortable and practical furniture and make it yours with meaningful trophies and decorations.\r\n[/p][p]\r\n[/p][p][b]Combat:[/b]\r\n[/p][p]Engage in fights against wild animals, monsters and spirits using diverse weapons, skills and techniques. Fight beasts after tracking them through the woods, defend yourself in ambushes or defeat any obstacles in front of you. Overcome your enemies by inflicting fatal wounds or by breaking their will to fight. \r\n[/p][p]\r\n[/p][p][b]Magic:[/b]\r\n[/p][p]A grounded, complex and creative system centered around the interaction with elemental, bestial and conceptual spirits. Bind spirits to your soul to gain new abilities, albeit at a personal cost, or craft magical items by trapping spirits within. [/p]","strSnippet":"Card Survival: Fantasy Forest is a card-based deep survival simulator and the next installment in the Card Survival Series. Carve yourself a home in a primordial forest that has a will of its own. A day-to-day life simulator in a world where nature reigns with mystery, beauty and sometimes cruelty."}}],["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":["COoHEJbHzr4GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUXkD4Au6XyILYNTD0L4GcJbHzr4G","COoHENy0yb4GGXN0rQIAAHABIavBQQEBABABKXzGKwAAAAAAUU4A4Au6XyILYIyiy74GcNy0yb4G","COoHEJTzw74GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUQQAcKKlX34HYNPBxb4GcJTzw74G","COoHEP6atL4GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUZYGENcSX2IHYIa+wb4GcP6atL4G","COoHEPGrub4GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUTYHENcSX2IHYMi9wb4GcPGrub4G","COoHEMbYvr4GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUScJENcSX2IHYO68wb4GcMbYvr4G","CB4QuNe+vgYZfZrxDgEAEAEhAAAAAAAAAAApfMYrAAAAAAA=","COoHEMyDsL4GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUUUGENcSX2IHYMyDsL4GcMyDsL4G","COoHEPbLqb4GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUTAFENcSX2IHYPbLqb4GcPbLqb4G","COoHEICcpL4GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUf0BENcSX2IHYNn0pr4GcICcpL4G","CB4QhK+kvgYZkV/nTwEAEAEhAAAAAAAAAAApfMYrAAAAAAA=","CAMQpKukvgYZkV/nTwEAEAEhAAAAAAAAAAApAAAAAAAAAAAwpLk+aPyMrwE=","COoHEN+wn74GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUQwAENcSX2IHYNWQob4GcN+wn74G","COoHELWAmr4GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUWMJgH5/Xg4HYLWAmr4GcLWAmr4G","COoHELrVlL4GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUfwHgH5/Xg4HYLrVlL4GcLrVlL4G","COoHEJTQkb4GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUbkHgH5/Xg4HYJTQkb4GcJTQkb4G","COoHEPHcir4GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUdcGgH5/Xg4HYPHcir4GcPHcir4G","COoHENX8hr4GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUcsEgH5/Xg4HYNX8hr4GcNX8hr4G","COoHELyUpb0GGXN0rQIAAHABIQOM6gABABABKXzGKwAAAAAAUToFMFHEXO4GYLyUpb0GcLyUpb0G"]}],["gameactivity",{"version":5,"data":[]}]]