[["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":[]}],["gameactivity",{"version":5,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"mttsus","strURL":null},{"strName":"Randomkey Inc.","strURL":null}],"rgPublishers":[{"strName":"mttsus","strURL":null},{"strName":"Randomkey Inc.","strURL":null}],"rgFranchises":[]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[p]Welcome to the thrilling world of Holy Clash Cards, where strategy meets destiny in a deck-building adventure like no other. In this captivating card game, players are thrust into the heart of an epic clash between righteousness and chaos, where every move shapes the fate of their faith and the destiny of their honorable army.\r\n[/p][p]\r\n[/p][p]Prepare to embark on a journey where victory is not just a goal but an imperative. In Holy Clash Cards, players are compelled to conquer, to triumph against all odds. However, the path to victory is fraught with peril, and losing is not just a setback—it's a test of faith.\r\n[/p][p]\r\n[/p][p]Craft your deck with cunning precision, selecting from a myriad of powerful cards imbued with divine abilities and tactical prowess. But remember, in this unforgiving arena, every decision counts. Will you bolster your forces with stalwart defenders, unleash devastating spells, or outmaneuver your opponents with cunning strategy? The choice is yours, but choose wisely, for the fate of your faith hangs in the balance.\r\n[/p][p]\r\n[/p][p]Engage in intense battles against formidable opponents, each with their own unique strengths and strategies. Adapt and overcome as you navigate through dynamic gameplay mechanics that keep you on the edge of your seat.\r\n[/p][p]\r\n[/p][p]With stunning visuals, immersive soundscapes, and intuitive gameplay, Holy Clash Cards offers an unparalleled gaming experience that will captivate both newcomers and seasoned veterans alike.\r\n[/p][p]\r\n[/p][p]Are you ready to embark on a journey of divine conquest? Join the fray and prove your mettle in Holy Clash Cards—where victory is not just a choice, but an absolute necessity. Will you rise to glory, or will your faith falter in the face of adversity? The fate of your army awaits.\r\n[/p][p]\r\n[/p][p]⚔️ New Armor Sets:[/p][p]Dominate the battlefield with brand-new armor sets![/p][p]Gather materials to craft these exclusive armors and outshine your rivals.[/p][p]🗺️ Active Map Enhancements:[/p][p]Get ready to explore new areas! Rich resources and hidden treasures await.[/p][p]Rare materials are now easier to find for dedicated gatherers.[/p][p]🏰 Castle Wars:[/p][p]Strategize, form alliances, and defend your castle![/p][p]Special rewards and updated leaderboard rankings for victorious players.[/p][p]🏗️ New Building Improvements:[/p][p]Fortify and beautify your castles with upgraded structures![/p][p]Boost production and grow your economy with new building options.[/p][p]🔥 New Mechanics and Updates:[/p][p]Performance improvements and bug fixes for a smoother experience.[/p][p]Dynamic new battle animations and visual effects for a more immersive gameplay experience.[/p][p]🎁 Special Update Reward![/p][p]Log in after the update to claim a surprise gift pack! Don't miss out – it's available for a limited time only![/p]","strSnippet":"Active Map Enhancements, Castle Wars, Building Improvements. Holy Clash Cards offers an unparalleled gaming experience that will captivate both newcomers and seasoned veterans alike. Will you rise to glory, or will your faith falter in the face of adversity? The fate of your army awaits."}}]]