[["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":["CB4QqtypwgYZfZrxDgEAEAEhAAAAAAAAAAApPtUtAAAAAAA="]}],["gameactivity",{"version":5,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Aquila Chengdu","strURL":"https://store.steampowered.com/developer/AquilaInteractive"}],"rgPublishers":[{"strName":"Aquila Interactive","strURL":"https://store.steampowered.com/publisher/AquilaInteractive"}],"rgFranchises":[]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[h2]Build Your Empire, Outsmart the Competition[/h2][p]Compete against AI-driven rival companies that will challenge your rise through takeovers, acquisitions, or price wars. Stay ahead by acquiring key ports, expanding your fleet, investing in shipyards, and making savvy economic moves. Outsmart opponents by mastering global trade, logistics, and dynamic market trends.[/p][list][*][p]Advanced AI competitors with takeover strategies and market pressure[/p][/*][/list][list][*][p]Dynamic business environment where every move counts[/p][/*][/list][p][img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3003710/extras/2_Map_500x210_.gif?t=1749707738[/img][/p][h2]Deep Simulation, Real Strategy[/h2][p]Manage every aspect of your shipping business from purchasing vessels and designing routes to balancing regional demand and responding to economic events. Success demands sharp decision-making and smart resource allocation.[/p][list][*][p]Full-scale management of ships, routes, ports, and resources[/p][/*][/list][list][*][p]Responsive economic systems that reflect global and local trends[/p][/*][/list][p][img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3003710/extras/4_Report_500x210_.gif?t=1749707738[/img][/p][h2]Cargo or Containers? Your Fleet, Your Strategy[/h2][p]Choose between customizable cargo ships and efficient container vessels. Optimize each ship's route and speed to maximize profits. As your business grows, build a diverse portfolio of assets from cutting-edge technology and capital to reputation and financial reserves.[/p][list][*][p]Multiple ship classes with distinct advantages and customization options[/p][/*][/list][list][*][p]Asset growth system including tech, capital, reputation, and infrastructure[/p][/*][/list][p][img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3003710/extras/5_Logistic_500x210_.gif?t=1749707738[/img][/p][h2]Chart a Course to Global Shipping Enterprise[/h2][p]In Global Magnates, your success depends on smart, strategic planning. Master the art of global route optimization by analyzing supply and demand across ports, anticipating market shifts, and building the most profitable shipping lanes. Every decision brings you closer to becoming a logistics titan.[/p][list][*][p] Real-time route planning influenced by live market demand[/p][/*][/list][list][*][p]Interactive global trade map with evolving port activity[/p][/*][/list][p][img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3003710/extras/3_Revenue_410x400_.gif?t=1749707738[/img][/p][p][/p]","strSnippet":"Global Magnates: Shipping Tycoon is a maritime simulation game, placing you at the head of a fledgling shipping empire with a new technology—the shipping container."}}]]