[["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":["COoHEIv6scEGGU1TZQAAAHABIUAIak4BABABKW6cBAAAAAAAUd8E4LbsZIYHYIv6scEGcIv6scEG"]}],["gameactivity",{"version":5,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Microids","strURL":"https://store.steampowered.com/developer/microids"}],"rgPublishers":[{"strName":"Microids","strURL":"https://store.steampowered.com/publisher/microids"}],"rgFranchises":[{"strName":"Syberia","strURL":"https://store.steampowered.com/franchise/syberiacollection"}]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/302190/extras/Banner_668x500_EN.jpg?t=1743167591[/img]\r\nFrom the creator of the [b]Syberia[/b] series, experience Benoit Sokal's first adventure game masterpiece. \r\n\r\nIn 1932, Alexandre Valembois was a young explorer who, with his native friend Antonio Álvarez, wanted to make a name for himself by exploring the mysterious Amerzone region. Befriended by the natives of the region, he witnessed a strange ritual involving a giant egg of the famed white birds. Wanting to prove that the white birds existed, Alexandre betrayed the natives' trust and stole the mysterious egg. Alas, upon his returning to France, nobody believed Alexandre or his journals about the Amerzone.\r\n\r\nSixty years have passed, and the world has changed. World War II has come and gone, the Amerzone remains unexplored and closed off to outsiders by its despotic leader, Antonio Álvarez. Monsieur Alexandre Valembois is an old man at the end of his life, living alone in a lighthouse and wishing to fix his mistake. This is when, a young reporter pays a visit to the old Alexandre Valembois regarding his adventures...\r\n\r\nCan you unravel the mystery of the white birds?","strSnippet":"The first adventure from the author of Syberia and Syberia 2, Benoît Sokal. In Amerzone you'll travel through enchanting landscapes, from Brittany to tropical forest. You'll have to solve the mystery of these famous white birds…"}}]]