[["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":[]}],["gameactivity",{"version":5,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Metal Games LLC","strURL":null}],"rgPublishers":[{"strName":"Metal Games LLC","strURL":null}],"rgFranchises":[]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3318320/extras/Overview.gif?t=1732128306[/img]\r\n\r\nMusgro Farm is a 3D incremental farming factory game. Start off with a modest farm on a small plot of land and grow it into the farming empire of your choosing. You start with only a couple basic crops to sell, but you'll soon be able to unlock more crops and increasingly complex systems.\r\n\r\nFields will grow crops over time. Buildings will assemble recipes. Vehicles will pick up, deliver, and sell products. You can invest in improving the efficiency of each one, but you'll need to balance your choices to avoid overwhelming any one part of the chain. If you wish to pursue peak efficiency then you'll want to optimize your layouts, invest in the right upgrades, and plan out your technology choices. Or you can just relax and watch as the farm runs and the numbers go up.\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/3318320/extras/Basic_Farm.gif?t=1732128306[/img]\r\n\r\nMusgro Farm incorporates elements from both incremental games [i](near-infinite upgradability, exponential level growth, huge numbers)[/i] and factory games [i](logistics, supply chains, recipes, layout planning)[/i]. While the game has a relatively chill atmosphere, there are a plethora of optimizations available to accelerate your progress. Build in whichever style you want: a simple farm following market trends, or a massive farming empire spanning for miles and churning out a vast array of complex recipes.","strSnippet":"Plant crops, combine them into recipes, and distribute them for sale in this incremental factory game. Optimize your layouts and reinvest in your infrastructure to maximize your output. Gain experience to unlock new technologies and expand your ever-growing farm."}}],["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}]]