[["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":[]}],["gameactivity",{"version":5,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Leadwerks Software","strURL":"https://store.steampowered.com/developer/leadwerks"}],"rgPublishers":[{"strName":"Leadwerks Software","strURL":"https://store.steampowered.com/publisher/leadwerks"}],"rgFranchises":[]}}],["descriptions",{"version":1,"data":{"strFullDescription":"Leadwerks Game Launcher lets you play a variety of creative, experimental, and just plain wacky mini-games made with [url=http://store.steampowered.com/app/251810]Leadwerks Game Engine[/url].  Fly a spaceship through an asteroid field, play a round of miniature golf, or ride a lawn mower while dodging killer cows.  It's free and there's a constant supply of new things to try.\r\n\r\nWith [url=http://steamcommunity.com/app/355500/workshop/]Steam Workshop[/url] integration, you can talk directly to the developers and give your feedback for new ideas to be incorporated into their games.  Start a discussion and let the devs know what you liked about their game, what can be improved, and any new ideas you have to add to their game.  Your feedback will help them design their game and create something new and unique for the Steam community to enjoy.\r\n\r\nIf you're looking for the latest polished blockbuster AAA game with no rough edges...this isn't it.  If you want to try something off the beaten path, complete with glitches, experimental ideas, unbeatable levels, and a never-ending variety of new things to do, get Leadwerks Game Launcher.  It's free and includes more than 25 mini-games, with new ones being added all the time.\r\n\r\nHere are some of the mini-games you can play right now for free:\r\n[list]\r\n[*]Hunt for Food\r\n[*]Asteroids3D\r\n[*]Vectronic\r\n[*]Mini Golf\r\n[*]Beach Roll\r\n[*]The Mower\r\n[*]Cuber\r\n[*]Evaluation Abridged\r\n[*]Castle Defender\r\n[*]The Hankinator's Funhouse\r\n[*]The Hankinator's Phantasmagoria\r\n[*]Slafstraf Horror\r\n[*]Cuber\r\n[*]Nuke\r\n[*]Tunnels of Tarkus\r\n[*]Rise of the Pumpkinheads\r\n[*]The Biodome\r\n[*]One More Day\r\n[*]Lockdown\r\n[/list]","strSnippet":"Leadwerks Game Launcher lets you play a variety of creative, experimental, and wacky mini-games made with Leadwerks Game Engine. Fly a spaceship through an asteroid field, play a round of golf, or ride a lawn mower while dodging killer cows. It's free and there's a constant supply of new things to try."}}],["workshop_trendy_items",{"version":2}]]