[["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":["COoHEOLay8EGGXY6gwAAAHABIXQ4hw4BABABKXyIBQAAAAAAUaEE0FFqZU4HYLGu1sEGcOLay8EG"]}],["gameactivity",{"version":5,"data":[]}],["workshop_trendy_items",{"version":2}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Coredumping","strURL":null}],"rgPublishers":[{"strName":"Coredumping","strURL":null}],"rgFranchises":[]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/362620/extras/RunCompany.png?t=1745827285[/img]\r\nConstruct and design buildings for optimal working conditions. Hire people to design and release software and hardware, so you can defeat the simulated competition and take over their businesses. Manage and educate your employees to make sure they are skilled and satisfied with their job.\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/362620/extras/CreateHeadquaters.png?t=1745827285[/img]\r\nBuy plots in a huge map to create and customize your own building. No grid necessary, just make sure there's coffee.\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/362620/extras/DesignProducts.png?t=1745827285[/img]\r\nCraft and manufacture software and hardware products, corner your market, defeat the competition, and make [b]them[/b] work for [b]you[/b].\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/362620/extras/ManageEmployees.png?t=1745827285[/img]\r\nCreate and optimize teams of employees with different skills and demands to release products in a timely fashion. Why not poach a big shot lead designer from a competitor to give you the edge?\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/362620/extras/SimulateMarket.png?t=1745827285[/img]\r\nEvery playthrough of Software Inc. is different, as the market is simulated and randomized. Each action you take affects how history plays out.\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/362620/extras/CurrentFeatures.png?t=1745827285[/img]\r\n[list]\r\n[*]Build, furnish, style and maintain office buildings up to ten stories + basement, on an enormous land, using a free-form building system with simple copy-paste tools\r\n[*]Hire employees to design, develop, support, update, research and market software and hardware in teams\r\n[*]Build roads, paths, bike racks and parking to ease commuting for your employees\r\n[*]Tend to your employees' needs, demands, skills and specializations, while making sure each team has compatibility and cohesion\r\n[*]Customize your own founder or split the company between a team of founders\r\n[*]Design and manufacture your own software and hardware products and franchises\r\n[*]Compete in a simulated and randomly populated market by selling your products, taking on contract work, creating patents, making deals and trading stocks\r\n[*]Set up your own servers for products, source control and running your own online store\r\n[*]Hire staff to repair your furniture and computers, clean your office, make food for your employees, transport goods, secure your offices or greet visitors\r\n[*]Mod what kind of software you can develop, add your own furniture, upload your building blueprints, add support for your language or write your own code to modify the game\r\n[*]Delegate important tasks to your team leaders, such as managing development cycles and human resources\r\n[*]Play against up to 3 other players in the same map or cooperate with your friends by delegating work tasks, manufacturing jobs and server hosting\r\n[/list]","strSnippet":"Construct and design buildings for optimal working conditions. Hire people to design and release software, so you can defeat the simulated competition and take over their businesses. Manage and educate your employees to make sure they are skilled and satisfied with their job."}}]]