[["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":[]}],["gameactivity",{"version":5,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Leppsoft","strURL":null}],"rgPublishers":[{"strName":"Leppsoft","strURL":null}],"rgFranchises":[]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[p]Play sounds in voice chats in high digital quality. Try the free demo now!\r\n[/p][p]\r\n[/p][p]You probably heard of soundboard, where people put sounds together like the popular Duke Nukem sounds. With Soundpad you can play them not only to yourself, but also to others.\r\n[/p][p]\r\n[/p][h2]Features[/h2][list][*][p] [b]Play sounds in voice chats[/b]\r\nWorks in any voice related application like Teamspeak, Mumble, Skype, Discord or games like Dota2, CS:GO or PUBG.\r\n[/p][/*][/list][p]\r\n[/p][list][*][p] [b]Hotkeys[/b]\r\nSet hotkeys for each and every sound file and play them quickly while ingame. \r\n[/p][/*][/list][p]\r\n[/p][list][*][p] [b]Sound recorder and editor[/b]\r\nSoundpad has a built-in Sound recorder, which allows you to record what you hear. The integrated editor helps you to cut the sounds quickly. \r\n[/p][/*][/list][p]\r\n[/p][list][*][p] [b]Volume normalization[/b]\r\nSome of your sound files are quiet while others are too loud? The integrated volume normalization will equalize the volume, so it meets the volume of your voice.\r\n[/p][/*][/list][p]\r\n[/p][list][*][p] [b]Easy setup[/b]\r\nSoundpad extends your default recording device, which most commonly is your microphone, without installing additional devices.\r\n[/p][/*][/list][p]\r\n[/p][list][*][p] [b]Supported file types[/b]\r\naac, flac, m4a, mp3, ogg, opus, wav, wma\r\n[/p][/*][/list][p]\r\n[/p][p][i]Check out the demo and start collecting your individual sounds![/i][/p]","strSnippet":"Play sounds in voice chats in high digital quality. Add sounds or music to your microphone signal so others will hear it, too."}}]]