[["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":[]}],["gameactivity",{"version":5,"data":[]}],["socialmedia",{"version":3,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Tombas Tomáš Basovnik","strURL":"https://store.steampowered.com/curator/28141547"},{"strName":"Martin Hoferek","strURL":"https://store.steampowered.com/curator/28141547"}],"rgPublishers":[{"strName":"Tombas Tomáš Basovnik","strURL":"https://store.steampowered.com/curator/28141547"},{"strName":"Martin Hoferek","strURL":"https://store.steampowered.com/curator/28141547"}],"rgFranchises":[]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[b]Annotation of Love[/b] is a set of three mini-games and three original Czech songs. While listening to songs you will experience particular stages of love and critical points of relationships. The main protagonist He experiences phases of being in love with She step by step. They look for things they have in common, get to know each other, and in the end…?\r\n\r\n[b]Three mini-games[/b] based on earning the highest score will push you to improve and thus examine your reflexes and brain. Games have time limit, which is the length of the song. You can compare your score from each mini-game with other players. The game will also attract you by its overall atmosphere.\r\n\r\nThe first mini-game – [b]&quot;Concubine&quot;[/b] will lead you to the stage of initial being in love. Try to run away anywhere, it will get you; but you can give it a try. Jump to avoid arrows She is shooting at you. Getting the hang of double-jump technique will test your skills. You gain one point for each successfully avoided arrow, and if you touch the arrow, you lose a point.\r\n\r\nIn the second mini-game [b]&quot;As a last-day we live&quot;[/b] you will try to find features He and She have in common. The game is an original form of Pairs. There are two stocks of cards, in which the first one represents features of He and the second one those of She. You draw from the left stock and try to find its match in the right one. The matching pictures aren’t the same, but they relate to one another. The help in the upper part of the screen gradually shows the correct pairs. Each pair found wins the player 10 points. Each mismatched pair loses one point.\r\n\r\nIn the third mini-game [b]&quot;Expiration date&quot;[/b] you will move to the stage in which the element of love is fading away and you get to the phase of fierce fights. As time goes by, you cease to understand each other and sometimes it happens that UFOs, or unidentified flying objects, start to fly upon you. In this game, those will be identified objects, namely plates. Touching a plate you break it and win a point for each one. If a plate hits you, you lose a point. As the game proceeds, She will learn how to throw plates faster and faster so that you will need to apply your skills you have gained during the years of practice typing on your mobile phone or clicking the mouse.\r\n\r\nWe will appreciate any kind of support and feedback.\r\n\r\nRegards:\r\n- Tomáš Basovník / @TombasOnly ([url=http://steamcommunity.com/groups/tombasonly]Steam Group[/url], Fb, Tw, Ig) - I’m an independent game developer. My mission is producing real fun digitally.\r\n- Martin Hoferek / Hofinband (Yt) - I’m an amateur graphic designer and musician. I hope you will enjoy the game at least as much as I did while creating it.","strSnippet":"Annotation of Love is a set of three mini-games and three Czech songs (EN, DE subtitles). While listening to original songs you will experience particular stages of love and critical points of relationships. The main protagonist He experiences phases of being in love with She step by step."}}]]