[["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":[]}],["gameactivity",{"version":5,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Eggcode","strURL":null}],"rgPublishers":[{"strName":"Eggcode","strURL":null}],"rgFranchises":[]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[b]BUILD YOUR OWN DREAM SKYSCRAPER[/b]\r\n\r\nIn &quot;Mad Tower Tycoon&quot; you can build your own skyscraper with more than 100 floors.\r\nThe classic construction gameplay leaves you all the freedom.\r\nRent offices, apartments or shops and build a financially lucrative skyscraper.\r\nBuild restaurants, cinemas, zoos or underground garages to satisfy your visitors.\r\nThere are countless ways to get the coveted &quot;six-star award&quot; for your skyscraper.\r\n\r\n\r\n[b]REALISTIC ELEVATORS[/b]\r\nThe waiting time should be increased? It should be avoided some floors?\r\nNo problem: the elevator system in &quot;Mad Tower Tycoon&quot; allows you different settings.\r\nAvoid your visitors having to climb too many stairs or wait too long for the elevator.\r\n\r\n[b]RANDOM EVENTS[/b]\r\nNot only dissatisfied tenants are causing you trouble.\r\nA fire in the new office, an earthquake shakes your skyscraper or UFOs kidnap your tenants.\r\nDifferent events provide variety and excitement.\r\n\r\n[b]LEVEL SYSTEM[/b]\r\nComplete daily missions and have good statistics to gain experience.\r\nEarn skill points and unlock more than 50 skills.\r\n\r\n[b]DETAILED STATISTICS[/b]\r\nYou want to see which floors are dirty or where the noise is unbearable?\r\nHow many visitors came in the last 24 hours? Have I made a higher profit in the last 30 days?\r\nThe statistics and filters in &quot;Mad Tower Tycoon&quot; will give you a lot of information about the state of your skyscraper.","strSnippet":"Design your own skyscraper with more than 100 Floors. Rent offices, apartments or shops and build a financially lucrative skyscraper. Build cinemas, bars or a theater to satisfy your visitors and create an effective transport system with elevators and stairs."}}],["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}]]