[["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":[]}],["gameactivity",{"version":5,"data":[]}],["socialmedia",{"version":3,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Ambiera","strURL":"https://store.steampowered.com/developer/ambiera"}],"rgPublishers":[{"strName":"Ambiera","strURL":"https://store.steampowered.com/publisher/ambiera"}],"rgFranchises":[]}}],["descriptions",{"version":1,"data":{"strFullDescription":"Business Magnate is a tycoon business simulation game where you can create all types of businesses: Cars, rockets, phones, tanks, trucks, airplanes, computers and ships. Design, produce, market and sell them. You can even run multiple companies at the same time. Become the ultimate Business Magnate (or Business Magnet).\r\n\r\n[h2]What can you do in the game[/h2]\r\n[list]\r\n[*] Company types: Cars, rockets, phones, tanks, trucks, airplanes, computers, ships\r\n[*] Build offices, warehouses, production facilities\r\n[*] Design products\r\n[*] Research new components and product types\r\n[*] Produce products and components\r\n[*] Run marketing campaigns\r\n[*] Manage employees\r\n[/list]\r\n\r\n[h2]How it works[/h2]\r\nStart by creating a company: First, choose what to produce. For example, you can design cars (combustion engine based, electric, hybrid), then produce, market and sell them. Other types of products are trucks, phones, computers, ships, airplanes, tanks and even rockets. Once you are successful, you can even start more companies, and run them at the same time.\r\n\r\n[h2]Design and Research[/h2]\r\n\r\nIn order to meet market demands, you need to design your products so that customers will actually want them, and won't prefer to buy your competitors products. Research new technologies and design new products as your move on to fit into a moving market. For example for cars, you want to research bigger and more efficient batteries, if you decide to produce electric cars, or more performant combustion engines if you want to produce gasoline or diesel based cars.\r\n\r\n[h2]Gameplay[/h2]\r\n\r\nThe game is running in real-time, but can be accelerated and paused at any time. Manage employees, track financial and sales data, start and run marketing campaigns, analyze the market. Expand your company when you have figured out how everything works and manage the production plan and build new facilities, warehouses, offices or even launch pads.","strSnippet":"Business Magnate is a tycoon business simulation game where you can create all types of businesses: Cars, rockets, phones, tanks, trucks, airplanes, computers, and ships. Design, produce, market and sell them. You can even run multiple companies at the same time."}}]]