[["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":[]}],["gameactivity",{"version":5,"data":[]}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Fish Pond Studio","strURL":"https://store.steampowered.com/developer/fishpondstudio"}],"rgPublishers":[{"strName":"Fish Pond Studio","strURL":"https://store.steampowered.com/publisher/fishpondstudio"}],"rgFranchises":[{"strName":"Fish Pond Idle","strURL":"https://store.steampowered.com/franchise/fishpondstudio"}]}}],["descriptions",{"version":1,"data":{"strFullDescription":"[h2]Feature Highlights[/h2]\r\n\r\n- 130+ different factories to build and manage\r\n- 90+ different resources to produce, buy and sell\r\n- Realistic market simulation that challenges your trading skill\r\n- 12+ Procedurally generated maps with both hex grid and square grid\r\n- Unlock 50+ powerful policies that drastically change the gameplay\r\n- Manage and optimize your economy with detailed charts and data tools\r\n- Offline earning based on your company's valuation\r\n- Prestige and unlock powerful upgrades\r\n\r\n[img]https://shared.akamai.steamstatic.com/store_item_assets/steam/apps/1574000/extras/game-preview.gif?t=1741289544[/img]\r\n\r\n[h2]Choose Your Own Play Style[/h2]\r\nEach factory has a lot of tweaks that you can micromanage and optimize. Or you can just sit back, trust the game AI and watch the numbers go up, either way, you can enjoy the game with your own play style. And you even get earnings when you are offline!\r\n\r\n[h2]Optimize Your Economy[/h2]\r\nThere are a lot of tools in the game to help you analyze your production bottlenecks, wasted resources, and imbalanced resource distribution. There are powerful policies that allow you to take your economy to a whole new direction.\r\n\r\n[h2]Trade with Global Players[/h2]\r\nTrade resources with global players in the real-time player market. Take advantage of lucrative deals from &quot;big sharks&quot; to advance in early games until you become a big shark and outsource your productions to other players.\r\n\r\n[h2]Prestige and Progress Further[/h2]\r\nPrestige allows you to unlock new maps with new resources and endless possibilities. You also earn $wiss money to unlock permanent upgrades to help with start faster and expand bigger.","strSnippet":"Industry Idle is an idle game that combines factory building, resource management and market trading. Design & build your base, expand & scale up your productions, improve & optimize your economy. Plus all the incremental game goodies: offline earnings, prestige to unlock more powerful upgrades."}}]]