[["achievementmap",{"version":5,"data":"[]"}],["usernews",{"version":5,"data":[]}],["gameactivity",{"version":5,"data":[]}],["achievements",{"version":2,"data":{"vecHighlight":[],"vecUnachieved":[],"vecAchievedHidden":[],"nTotal":0,"nAchieved":0}}],["associations",{"version":2,"data":{"rgDevelopers":[{"strName":"Jackbox Games, Inc.","strURL":"https://store.steampowered.com/developer/jackboxgames"}],"rgPublishers":[{"strName":"Jackbox Games, Inc.","strURL":"https://store.steampowered.com/publisher/jackboxgames"}],"rgFranchises":[{"strName":"Jackbox Games","strURL":"https://store.steampowered.com/franchise/jackboxgames"}]}}],["descriptions",{"version":1,"data":{"strFullDescription":"Updated with awesome new features:\r\nNow playable in English, French, Italian, German and Spanish.\r\nA content filtering tool that helps block offensive answers from players.\r\nA new moderation tool that allows player answers to be reviewed before they appear on the game screen.\r\n\r\nThe team behind the hit party games Fibbage, Quiplash, and YOU DON’T KNOW JACK presents Drawful 2 the game of terrible drawings and hilariously wrong answers! Use your phone or tablet to draw funny and challenging things like “creepy tiger” or “two moms having a great day.”\r\n\r\nPlayers type in what they think the (probably terrible) drawing really is and then everyone - even an audience of potentially thousands of players – votes on what they think is the correct answer.\r\n\r\nDrawful 2 is a go-to party game that everyone can play and enjoy!\r\n\r\nDrawful 2 improves on the original Drawful with the ability to add your own user-generated prompts to make even weirder games full of in-jokes with your friends, as well as expanded tools for streaming.\r\n\r\nNote: This game is local multiplayer, but can be enjoyed over streams with remote players.\r\n\r\n[b]How to Play Remotely[/b]\r\n[url]https://www.jackboxgames.com/remoteplay/[/url]\r\nPlayers use any web-enabled device (like a smartphone or tablet) to join the game and play along. When playing with remote players, you can use a video conferencing tool like Zoom, Steam Broadcast, Google Hangouts, Discord, and more to connect with others! Just share your screen while on a call and make sure you look for prompts to share audio. Visit our Remote Play page for more tips and tutorials.","strSnippet":"For 3-8 players and an audience of thousands! Your phones or tablets are your controllers! The game of terrible drawings and hilariously wrong answers."}}]]